# Добро пожаловать на первое практическое занятие!
# Вам необходимо установить Python, Pycharm из вводного урока №2
# А также собрать и скомпилировать ваш первый проект "Hello world".
# Установите Python и Pycharm из урока "Установка среды разработки PyCharm и Python."
# Создайте новый проект в Pycharm. На главном экране нажмите New Project, а далее Create
# В файле main.py Напишите команду print("Hello world")
# Нажмите кнопку сборки проекта. В консоли вы увидите "Hello world" - это результат работы вашей программы, а значит у вас все получилось и все установлено корректно
# По любым вопросам в ходе выполнения практического задания вы всегда можете связаться с преподавателем.

print('Hello world')